{"id":"app-13a24c46","company":"Crunched","role":"Software Engineer Founding Team","status":"interviewing","date_applied":"2025-12-22","jd_content":"Software Engineer | Founding Team Early-Stage Startup | $5M+ Raised\n\nHi Eduardo,\n\nI have partnered with a fast-growing startup developing a cutting-edge Agentic AI layer for business applications.\n\nThe organization is VC-backed and have recently closed a $5M+ round of funding in just 5 days.\n\nThey are seeking to hire experienced Software Engineers, who will be a founding member of the engineering team \u0026 will play a pivotal role contributing to the development of their agentic AI model.\n\nMy client's product is a LLM-based application and they are looking for full-stack SW Engineers with the following tech stack experience: Python, TypeScript, React, and Postgres. Their key libraries are FastAPI, Pydantic, and LangGraph.\n\nI am reaching out to you as I am confident your experience at Labrynth aligns with their expectations \u0026 meets their exceptional performance indicators that they use to identify \u0026 hire top-talent.\n\nThis will be an on-site role in Oslo. With regards to compensation they offer attractive salaries competitive with FAANG companies.\n\nIf this is of interest, when might we speak \u0026 what is the best number to contact you on?\n\nScarlett Robinson\nBD Executive | Metric Geo | AI \u0026 Generative AI","notes":"Oslo, Norway. Agentic AI startup via Metric Geo recruiter (Scarlett Robinson). Interview scheduled Jan 2nd. VC-backed, M+ raised.","created_at":"2025-12-25T11:40:45.072456-03:00","updated_at":"2025-12-25T11:40:45.072456-03:00"}
{"id":"app-2ab807b9","company":"EPAM","role":"Python Developer GenAI","status":"applied","date_applied":"2025-12-23","jd_url":"https://www.linkedin.com/jobs/view/4348832703","jd_content":"Python Developer (GenAI) - EPAM Systems\n\nPosition: Python Developer (GenAI)\nCompany: EPAM Systems\nLocation: Zurich, Zurich, Switzerland\nSeniority Level: Mid-Senior\nEmployment Type: Full-time\n\nOverview:\nEPAM seeks a GenAI specialist to join their banking sector team, focusing on enhancing application UI/UX with ReactJS and integrating ChatGPT/OpenAI solutions.\n\nKey Responsibilities:\n- Design and implement use cases leveraging AI/ML and GenAI technologies\n- Set up and manage Azure environments for building and deploying AI/ML solutions\n- Deliver features end-to-end with high-quality implementation\n- Participate in architectural decision-making\n- Engage with business stakeholders on deliverables and feedback\n\nCore Requirements:\n- 5+ years IT experience with production-grade Python expertise\n- REST API development using Flask, Django or FastAPI\n- LangGraph ecosystem familiarity\n- Deep Learning theory, language models, and transformer understanding\n- LLM fundamentals knowledge: Prompting, RAG, Function Calling, Agentic Workflows\n- Minimum 1 year delivering end-to-end GenAI agentic solutions\n- GenAI solution performance optimization ability\n- Docker and Git experience\n\nPreferred Qualifications:\n- ReactJS or Angular exposure\n- RDBMS understanding\n- Azure or public cloud exposure\n\nBenefits:\n5 weeks vacation, stock purchase plan, enhanced parental leave, extended pension, daily sickness allowance, employee assistance, global travel insurance, and 22,000+ LinkedIn Learning courses.\n\nEligibility:\nSwiss nationals, EU/EFTA nationals, third-country nationals with work permits, or displaced Ukrainians with S permits.","notes":"Zurich, Switzerland. Banking sector, GenAI/LLM focus.","created_at":"2025-12-25T11:44:32.450671-03:00","updated_at":"2025-12-25T11:44:32.450671-03:00"}
{"id":"app-bd51f667","company":"ZEVEN","role":"Senior AI Engineer","status":"applied","date_applied":"2025-12-23","jd_url":"https://www.linkedin.com/jobs/view/4328707785","jd_content":"Senior AI Engineer Position at ZEVEN\n\nJob Title: Artificial Intelligence Engineer (Senior level)\nCompany: ZEVEN\nLocation: Zurich, Switzerland\nEmployment Type: Full-time\n\nCompany Overview:\nZEVEN is a newly-founded startup focused on revolutionizing sports through AI-powered solutions. The team aims to unlock human potential and redefine the sports experience through innovation.\n\nKey Responsibilities:\n- Lead design and development of AI/ML systems emphasizing quality and maintainability\n- Convert research prototypes into production-ready solutions and pipelines\n- Handle complex datasets including geospatial, sensor, and time-series information\n- Optimize system performance, efficiency, and scalability\n- Ensure testing rigor, reproducibility, and thorough documentation\n- Mentor junior team members and establish MLOps best practices\n- Stay current with AI engineering trends and integrate innovations\n\nRequired Qualifications:\n\nExperience:\n- 5+ years in AI engineering, machine learning development, or applied ML roles\n\nTechnical Skills:\n- Full ML lifecycle expertise (MLOps)\n- Cloud infrastructure proficiency, preferably AWS with serverless computing and GPU clusters\n- Python proficiency for AI/ML development and deployment\n- Knowledge of agentic AI systems, LLMs, foundation models, inference, fine-tuning, RAG, and prompt engineering\n- Ability to evaluate AI methods for practical performance and reliability\n- Proficiency with frameworks like LangChain, MCP, Hugging Face, and LLM APIs\n\nDesired Qualities:\n- Strong problem-solving and debugging capabilities\n- Excellent communication and cross-functional collaboration skills\n- Attention to detail and quality focus\n- Accountability and ownership mindset\n- Creative, open thinking approach\n\nNice-to-Have Qualifications:\n- Open-source AI/ML contributions\n- Experience guiding AI/ML projects or teams\n- Background with sports, human movement, or performance data\n- Prior collaboration with research, web, and product teams\n\nWhat ZEVEN Offers:\n- Competitive salary with benefits package including stock options, pension plan bonus, 25 vacation days plus holidays\n- Flexible hybrid work arrangement\n- Company outings and sports events\n- Equipment: MacBook Pro laptops, standing desks\n- Office location near Zurich lake with public transport access and full kitchen facilities\n- Early-stage equity compensation\n- Opportunity to impact products reaching millions of users\n\nTeam Culture:\nThe company values genuine passion for outdoor sports. Team members speak multiple languages (German, Basque, French, Spanish) with English as the primary workplace language.","notes":"Zurich, Switzerland. Sports AI startup. Cover letter included personal sports background (tennis, climbing, sailing, skate, surf, kitesurf) and N=1 experiment philosophy.","created_at":"2025-12-25T11:47:54.414761-03:00","updated_at":"2025-12-25T11:47:54.414761-03:00"}
{"id":"app-4965a38e","company":"Caffeine.ai","role":"Machine Learning Engineer","status":"rejected","date_applied":"2025-12-24","jd_content":"At Caffeine.ai, we are building the world's first platform to create full-stack, on-chain applications through natural language. Our mission is to make building software as simple as a conversation - transforming ideas into live applications instantly. \nWe are a cross-functional team of engineers and researchers building the AI that powers this new paradigm. To do this, we need world-class product engineers who can design beautiful, reliable, and performant experiences across the stack.\n\nAbout the Role\n\nWe are looking for a Machine Learning Engineer to help build the next generation of our agentic AI system. You'll work directly on the intelligence behind specification generation, dependency planning, backend \u0026 frontend code generation, error-repair loops, E2E evaluation, dataset quality, and model integrations.\n\nYou will play a key role in designing and evolving an agent-based architecture for app creation - enabling modularity, versioning, observability, and continuous improvement across all stages of the pipeline, from user intent to deployed application.\n\nYou'll be joining the AI team and collaborate across teams to ship reliable, scalable, and innovative AI features into production.\n\nWhat You'll Do\n\n- Contribute to the design and implementation of multi-agent LLM architectures that power Caffeine's full-stack code generation pipeline.\n- Build and maintain training datasets, including synthetic generation, filtering, validation, and alignment mechanisms.\n- Develop post-training and fine-tuning pipelines (SFT, RLHF/RLVR, preference modeling) to improve reasoning, reliability, and code quality.\n- Design and extend evaluation harnesses, including error-reproduction, regression detection, benchmarks, and E2E AI-generated app evaluations.\n- Implement and refine RAG / context engineering pipelines to provide the right context for each agent stage.\n- Collaborate with the Integration, App, SRE, and Infra teams to ensure reliability, observability, and maintainability of the AI system in production.\n- Participate in rapid experimentation, benchmarking, ablations, and architectural improvements.\n\nWho You Are\n\n- Bachelor's or Master's in Computer Science, Machine Learning, Engineering, or a related field.\n- Experience with full-stack TypeScript (e.g., React/Next.js, Node.js/NestJS/Fastify) and monorepo tooling (e.g., pnpm, Turborepo)\n- Experience training, fine-tuning, or evaluating LLMs (SFT, RLHF, RAG, or similar).\n- Experience with LLM-based code generation, compilers, or static analysis.\n- Comfortable working in a TypeScript-heavy product codebase and enjoy the intersection of ML and software engineering.\n- Comfortable working in fast-moving, highly technical environments.\n- Background in multi-agent architectures or structured reasoning.\n\nBonus\n\n- Publications or prior work involving LLMs, agents, program synthesis, or automated code generation.\n- Experience with large-scale training pipelines (e.g., distributed training, DeepSpeed).\n- Strong interest in designing modular, versioned agentic systems.\n- Experience with prompt engineering for complex multi-step workflows.\n\n*This is a hybrid role based in our Zurich office, with a requirement of 3+ days in the office per week.","notes":"Zurich, Switzerland (hybrid 3+ days). Multi-agent LLM architectures, code generation. Rejected.","created_at":"2025-12-25T11:49:24.499534-03:00","updated_at":"2025-12-25T11:49:24.499534-03:00"}
{"id":"app-8c66d25e","company":"ELCA Group","role":"Senior AI Engineer","status":"applied","date_applied":"2025-12-25","jd_url":"https://www.linkedin.com/jobs/view/4328847737","jd_content":"Senior AI Engineer - ELCA Group\n\nCompany: ELCA Group\nLocation: Lausanne, Vaud, Switzerland\nEmployment Type: Full-time\nJob Function: Engineering and Information Technology\nIndustries: IT Services and IT Consulting\n\nRole Overview:\nThis position requires leading comprehensive artificial intelligence and data science initiatives, transitioning complex business problems into scalable, production-ready systems.\n\nKey Responsibilities:\n- Oversee end-to-end AI/ML projects from initial analysis to solution delivery\n- Examine and construct machine learning models addressing real-world business needs\n- Create dependable data pipelines transforming raw data into high-quality training inputs\n- Design and maintain MLOps systems for automated training, deployment, and monitoring\n- Mentor junior data scientists and establish technical best practices\n- Collaborate with interdisciplinary teams across IT, engineering, and business functions\n- Present insights to both technical and non-technical audiences\n\nRequired Qualifications:\n- 5+ years in AI, data science, or machine learning engineering\n- University degree in technical field\n- Strong Python programming with modern ML frameworks (scikit-learn, TensorFlow, PyTorch)\n- Solid grasp of data analysis, MLOps, and production-grade ML systems\n- Software engineering fundamentals knowledge (Linux/Windows, Git, APIs, data storage)\n- Analytical mindset with autonomous problem-solving abilities\n- Fluency in French and English\n- Willingness to travel within Romandie region\n\nPreferred Qualifications:\n- Experience with cloud platforms and big data technologies\n\nWhat ELCA Group Offers:\n- Collaborative, skilled professional environment\n- Meaningful projects using contemporary AI technologies\n- Flat organizational structures\n- Direct customer exposure across diverse industries\n- Strong professional development opportunities","resume_path":"outputs/elca_senior_ai_engineer/resume.html","notes":"Lausanne, Switzerland. Addressed French language gap in cover letter - candidate has English, Portuguese, Spanish but not French.","created_at":"2025-12-25T11:50:15.641413-03:00","updated_at":"2025-12-25T11:50:15.641413-03:00"}
{"id":"app-dc94bfa8","company":"RJC Group","role":"Senior Python Developer","status":"applied","date_applied":"2025-12-23","jd_url":"https://www.linkedin.com/jobs/view/4343254773","jd_content":"Senior Python Developer - RJC Group\n\nJob Title: Python Developer (Senior level)\nCompany: RJC Group\nLocation: Geneva, Switzerland\nEmployment Type: Full-time\nSeniority Level: Mid-Senior level\nJob Function: Information Technology\nIndustry: Software Development\n\nKey Responsibilities:\nThe role combines hands-on coding with mentoring capabilities. Main duties include:\n- Developing complex high performance applications\n- Converting business requirements into technical implementations\n- Ensuring code standards and documentation quality\n- Partnering with international teams and stakeholders\n- Contributing to shared component libraries (desired skill)\n\nRequirements:\n\nEssential Skills:\n- 3+ years Python development experience\n- SQL proficiency (Oracle/PL SQL)\n- Strong communication abilities and attention to detail\n\nCompensation \u0026 Benefits:\n- Base salary: up to £140,000\n- Performance bonus: up to 100%\n- Full relocation package with support\n- Collaborative and flat structured work environment\n\nAdditional Information:\n- Over 200 applicants received\n- Direct contact: Joseph Doyle, Tech Team Leader","notes":"Geneva, Switzerland. Commodities trading. Up to £140k + 100% bonus. Relocation package available.","created_at":"2025-12-25T11:54:18.020631-03:00","updated_at":"2025-12-25T11:54:18.020631-03:00"}
